# Setup for run in vscode (optional)

In [60]:
!pip install ipython-sql psycopg2-binary sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (0.5.0)
Requirement already satisfied: psycopg2-binary in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.9.11)
Requirement already satisfied: sqlalchemy in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.0.45)
Requirement already satisfied: prettytable in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython-sql) (8.23.0)
Requirement already satisfied: sqlparse in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython-sql) (0.5.5)
Requirement already satisfied: six in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: decorator in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (2.17.2)
Requirement already satisfied: stack-data in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (5.14.2)
Requirement already satisfied: colorama in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

[notice] A new release of pip is available: 24.3.1 -> 26.0.1
[notice] To update, run: C:\Users\Asus\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [ ]:
%load_ext sql
%sql postgresql://postgres:passwordhere@localhost:5432/dvdrental

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [79]:
%reload_ext sql

In [77]:
# Fix the prettytable style configuration issue
import prettytable
prettytable.PLAIN_COLUMNS = prettytable.SINGLE_BORDER

C:\Users\Asus\AppData\Local\Temp\ipykernel_7200\3762352615.py:3: DeprecationWarning: the 'SINGLE_BORDER' constant is deprecated, use the 'TableStyle' enum instead
  prettytable.PLAIN_COLUMNS = prettytable.SINGLE_BORDER

# Database Midterm SQL

## 4a
Show all films that relate to 'China' or 'India' based on description.
As the following picture (a part of expected output)
the output must contain 3 columns: film_id, film_title, and film_description.

In [81]:
%%sql
SELECT film_id, title, description
FROM film
WHERE description LIKE '%China%' 
OR description LIKE '%India%'

 * postgresql://postgres:***@localhost:5432/dvdrental
79 rows affected.

,film_id,title,description
0,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...
1,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...
2,6,Agent Truman,A Intrepid Panorama of a Robot And a Boy who m...
3,10,Aladdin Calendar,A Action-Packed Tale of a Man And a Lumberjack...
4,29,Antitrust Tomatoes,A Fateful Yarn of a Womanizer And a Feminist w...
...,...,...,...
74,962,Wasteland Divine,A Fanciful Story of a Database Administrator A...
75,970,Westward Seabiscuit,A Lacklusture Tale of a Butler And a Husband w...
76,986,Wonka Sea,A Brilliant Saga of a Boat And a Mad Scientist...
77,989,Working Microcosmos,A Stunning Epistle of a Dentist And a Dog who ...
78,999,Zoolander Fiction,A Fateful Reflection of a Waitress And a Boat ...

## 4b
Show all films that have zero inventory.
As the following picture (a part of expected output)
the output must contain 3 columns: film_id, film_title, and total_inventory.

In [ ]:
%%sql
SELECT *, f.film_id, f.title, i.store_id -- not sure if it inventory_id or store_id
FROM film f
LEFT JOIN inventory i
ON f.film_id = i.film_id
WHERE i.store_id is NULL

## 4c
Show the category of all films with a title starts with 'A'.
As the following picture (a part of expected output)
the output must contain 5 columns: category_id, category_name, film_id, film_title, and rank.

In [ ]:
%%sql
SELECT fc.category_id, c.name, f.film_id, f.title, RANK() OVER(ORDER BY f.title) AS rank -- RANK BY WHAT?
FROM film f
LEFT JOIN film_category fc
ON f.film_id = fc.film_id
LEFT JOIN category c
ON fc.category_id = c.category_id
WHERE f.title LIKE 'A%'

## 4d
Show the top 5 customers in each store based on the total number of rentals.
As the following picture (a part of expected output)
the output must contain 5 columns: store_id, customer_id, first_name, last_name, and num_of_rental.

In [86]:
%%sql 

-- CTE

WITH RankedCustomers AS (
    SELECT 
        c.store_id,
        c.customer_id,
        c.first_name,
        c.last_name,
        COUNT(r.rental_id) AS num_of_rental,
        ROW_NUMBER() OVER(PARTITION BY c.store_id ORDER BY COUNT(r.rental_id) DESC) as rank
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.store_id, c.customer_id, c.first_name, c.last_name
)
SELECT 
    store_id,
    customer_id,
    first_name,
    last_name,
    num_of_rental
FROM RankedCustomers
WHERE rank <= 5
ORDER BY store_id, num_of_rental DESC;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

   store_id  customer_id first_name last_name  num_of_rental
0         1          148    Eleanor      Hunt             46
1         1          236     Marcia      Dean             42
2         1          144      Clara      Shaw             42
3         1          468        Tim      Cary             39
4         1          295      Daisy     Bates             38
5         2          526       Karl      Seal             45
6         2           75      Tammy   Sanders             41
7         2          469     Wesley      Bull             40
8         2          197        Sue    Peters             40
9         2          178     Marion    Snyder             39

In [91]:
%%sql 
-- subquery
SELECT store_id, customer_id, first_name, last_name, num_of_rental
FROM (
    SELECT 
        store_id, customer_id, first_name, last_name, 
        COUNT(*) AS num_of_rental,
        ROW_NUMBER() OVER(PARTITION BY store_id ORDER BY COUNT(*) DESC) as rank
    FROM customer
    JOIN rental USING (customer_id)
    GROUP BY 1, 2, 3, 4
) subquery
WHERE rank <= 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

   store_id  customer_id first_name last_name  num_of_rental
0         1          148    Eleanor      Hunt             46
1         1          236     Marcia      Dean             42
2         1          144      Clara      Shaw             42
3         1          468        Tim      Cary             39
4         1          295      Daisy     Bates             38
5         2          526       Karl      Seal             45
6         2           75      Tammy   Sanders             41
7         2          469     Wesley      Bull             40
8         2          197        Sue    Peters             40
9         2          178     Marion    Snyder             39

## 4e
Show the length of each rental is longer or shorter than the average rental length of the film it's associated.
As the following picture (a part of expected output)
the output must contain 7 columns: film_title, inventory_id, rental_id, rental_length, avg_length, rental_length_diff, and type

In [85]:
%%sql
SELECT 
    f.title AS film_title,
    i.inventory_id,
    r.rental_id,
    
    -- 1. Calculate the rental length using age()
    age(r.return_date, r.rental_date) AS rental_length,
    
    -- 2. Calculate the average length partitioned by the specific film
    avg(age(r.return_date, r.rental_date)) over (partition by f.film_id) AS avg_length,
    
    -- 3. Calculate the difference
    (age(r.return_date, r.rental_date) - avg(age(r.return_date, r.rental_date)) over (partition by f.film_id)) AS rental_length_diff,
    
    -- 4. The CASE statement to determine the type
    (CASE 
        WHEN age(r.return_date, r.rental_date) > avg(age(r.return_date, r.rental_date)) over (partition by f.film_id) THEN 'longer'
        WHEN age(r.return_date, r.rental_date) < avg(age(r.return_date, r.rental_date)) over (partition by f.film_id) THEN 'shorter'
        ELSE 'equal' 
    END) AS type
    
FROM film f
LEFT JOIN inventory i ON f.film_id = i.film_id
LEFT JOIN rental r ON i.inventory_id = r.inventory_id
ORDER BY f.title, r.rental_id;

 * postgresql://postgres:***@localhost:5432/dvdrental
16087 rows affected.

,film_title,inventory_id,rental_id,rental_length,avg_length,rental_length_diff,type
0,Academy Dinosaur,6.0,361.0,4 days 00:58:00,4 days 23:55:51.818182,-1 days +01:02:08.181818,shorter
1,Academy Dinosaur,2.0,972.0,6 days 04:15:00,4 days 23:55:51.818182,1 days 04:19:08.181818,longer
2,Academy Dinosaur,7.0,1210.0,4 days 22:44:00,4 days 23:55:51.818182,-1 days +22:48:08.181818,shorter
3,Academy Dinosaur,2.0,2117.0,5 days 21:21:00,4 days 23:55:51.818182,0 days 21:25:08.181818,longer
4,Academy Dinosaur,6.0,3201.0,7 days 03:12:00,4 days 23:55:51.818182,2 days 03:16:08.181818,longer
...,...,...,...,...,...,...,...
16082,Zorro Ark,4577.0,12854.0,5 days 01:58:00,4 days 12:56:25.161291,0 days 13:01:34.838709,longer
16083,Zorro Ark,4581.0,12894.0,5 days 22:02:00,4 days 12:56:25.161291,1 days 09:05:34.838709,longer
16084,Zorro Ark,4574.0,13236.0,8 days 01:30:00,4 days 12:56:25.161291,3 days 12:33:34.838709,longer
16085,Zorro Ark,4575.0,14599.0,1 days 01:10:00,4 days 12:56:25.161291,-4 days +12:13:34.838709,shorter
16086,Zorro Ark,4580.0,15916.0,8 days 03:53:00,4 days 12:56:25.161291,3 days 14:56:34.838709,longer